<h1>SOLID</h1>
<h2>S - Single Responsibility (Принцип единственной ответственности)</h2>
<p>Каждый класс должен отвечать только за одну операцию</p>
<h2>O - Open-Closed (Принцип открытости-закрытости)</h2>
<p>Классы должны быть открыты для расширения, но закрыты для модификации</p>
<h2>L - Liskov Substitution (Принцип подстановки Барбары Лисков)</h2>
<p>Если П является подтипом Т, то любые объекты типа Т, присутствующие в программе,
могут заменяться объектами типа П без негативных последствий для функциональности программы</p>
<h2>I - Interface Segregation (Принцип разделения интерфейсов)</h2>
<p>Не следует ставить клиент в зависимость от методов, которые он не использует</p>
<h2>D - Dependency Inversion (Принцип инверсии зависимостей)</h2>
<p>Модули верхнего уровня не должны зависеть от модулей нижнего уровня
И те, и другие должны зависеть от абстракций
Абстракции не должны зависеть от деталей
Детали должны зависеть от абстракций</p>
<p>Модули (или классы) верхнего уровня = классы, которые выполняют операцию при помощи инструмента
Модули (или классы) нижнего уровня = инструменты, которые нужны для выполнения операций
Абстракции – представляют интерфейс, соединяющий два класса
Детали = специфические характеристики работы инструмента</p>
<p>Согласно данному принципу, класс не должен соединяться с инструментом, который применяет для выполнения операции
Вместо этого он должен быть соединён с интерфейсом, который поможет установить связь между инструментом и классом</p>
<p>Кроме того, принцип гласит, что ни интерфейс, ни класс, не обязаны вникать в специфику работы инструмента
Напротив, это инструмент должен подходить под требования интерфейса</p>
<p><a href="https://habr.com/ru/companies/productivity_inside/articles/505430/">https://habr.com/ru/companies/productivity_inside/articles/505430/</a></p>